; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v4 ?v7)
             (pred_12 ?v11 ?v13)
             (pred_4 ?v4 ?v13)
             (pred_6 ?v2 ?v4 )
	     (pred_2 ?v4)
             (pred_8 ?v9)
             (pred_7 ?v11)
             (pred_3 ?v13)
             (pred_9 ?v4)
             (pred_1 ?v11)
             (pred_10 ?v4)
             (pred_5 ))



(:action op_3
:parameters (?v6 ?v10 ?v3 ?v12)
:precondition (and (pred_8 ?v6) (pred_8 ?v10) (pred_7 ?v3) (pred_3 ?v12)
          (pred_11 ?v6 ?v10) (pred_12 ?v3 ?v12)
                   (pred_4 ?v10 ?v12) (pred_2 ?v6) 
                   (pred_9 ?v10) (pred_1 ?v3))
:effect (and  (pred_10 ?v10) (not (pred_9 ?v10))))


(:action op_2
:parameters (?v6 ?v1)
:precondition (and (pred_8 ?v6) (pred_8 ?v1)
               (pred_2 ?v6) (pred_11 ?v6 ?v1) (pred_10 ?v1))
:effect (and (pred_2 ?v1) (not (pred_2 ?v6))))

(:action op_4
:parameters (?v6 ?v3)
:precondition (and (pred_8 ?v6) (pred_7 ?v3) 
                  (pred_2 ?v6) (pred_6 ?v3 ?v6) (pred_5 ))
:effect (and (pred_1 ?v3)
   (not (pred_6 ?v3 ?v6)) (not (pred_5 ))))


(:action op_5
:parameters (?v6 ?v8 ?v5)
:precondition (and (pred_8 ?v6) (pred_7 ?v8) (pred_7 ?v5)
                  (pred_2 ?v6) (pred_1 ?v5) (pred_6 ?v8 ?v6))
:effect (and (pred_1 ?v8) (pred_6 ?v5 ?v6)
        (not (pred_1 ?v5)) (not (pred_6 ?v8 ?v6))))

(:action op_1
:parameters (?v6 ?v3)
:precondition (and (pred_8 ?v6) (pred_7 ?v3) 
                  (pred_2 ?v6) (pred_1 ?v3))
:effect (and (pred_5 ) (pred_6 ?v3 ?v6) (not (pred_1 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_20 obj_16 obj_04 obj_19 obj_08 obj_10 obj_21 obj_06 obj_13 obj_18 obj_05 obj_07 obj_15 obj_14 obj_11 obj_03
    obj_01 obj_09
    obj_12 obj_02 obj_17
    )

    (:init
       (pred_5)

       (pred_8 obj_20)
       (pred_8 obj_16)
       (pred_8 obj_04)
       (pred_8 obj_19)
       (pred_8 obj_08)
       (pred_8 obj_10)
       (pred_8 obj_21)
       (pred_8 obj_06)
       (pred_8 obj_13)
       (pred_8 obj_18)
       (pred_8 obj_05)
       (pred_8 obj_07)
       (pred_8 obj_15)
       (pred_8 obj_14)
       (pred_8 obj_11)
       (pred_8 obj_03)
       (pred_3 obj_01)
       (pred_3 obj_09)
       (pred_7 obj_12)
       (pred_7 obj_02)
       (pred_7 obj_17)

       (pred_11 obj_20 obj_08)
       (pred_11 obj_20 obj_16)
       (pred_11 obj_16 obj_10)
       (pred_11 obj_16 obj_04)
       (pred_11 obj_16 obj_20)
       (pred_11 obj_04 obj_21)
       (pred_11 obj_04 obj_19)
       (pred_11 obj_04 obj_16)
       (pred_11 obj_19 obj_06)
       (pred_11 obj_19 obj_04)
       (pred_11 obj_08 obj_13)
       (pred_11 obj_08 obj_10)
       (pred_11 obj_08 obj_20)
       (pred_11 obj_10 obj_18)
       (pred_11 obj_10 obj_21)
       (pred_11 obj_10 obj_16)
       (pred_11 obj_10 obj_08)
       (pred_11 obj_21 obj_05)
       (pred_11 obj_21 obj_06)
       (pred_11 obj_21 obj_04)
       (pred_11 obj_21 obj_10)
       (pred_11 obj_06 obj_07)
       (pred_11 obj_06 obj_19)
       (pred_11 obj_06 obj_21)
       (pred_11 obj_13 obj_15)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_13 obj_08)
       (pred_11 obj_18 obj_14)
       (pred_11 obj_18 obj_05)
       (pred_11 obj_18 obj_10)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_05 obj_11)
       (pred_11 obj_05 obj_07)
       (pred_11 obj_05 obj_21)
       (pred_11 obj_05 obj_18)
       (pred_11 obj_07 obj_03)
       (pred_11 obj_07 obj_06)
       (pred_11 obj_07 obj_05)
       (pred_11 obj_15 obj_14)
       (pred_11 obj_15 obj_13)
       (pred_11 obj_14 obj_11)
       (pred_11 obj_14 obj_18)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_11 obj_03)
       (pred_11 obj_11 obj_05)
       (pred_11 obj_11 obj_14)
       (pred_11 obj_03 obj_07)
       (pred_11 obj_03 obj_11)
       (pred_9 obj_18)
       (pred_9 obj_10)
       (pred_9 obj_21)
       (pred_4  obj_18 obj_01)
       (pred_4  obj_10 obj_09)
       (pred_4  obj_21 obj_09)
       (pred_10 obj_20)
       (pred_10 obj_16)
       (pred_10 obj_04)
       (pred_10 obj_19)
       (pred_10 obj_08)
       (pred_10 obj_06)
       (pred_10 obj_13)
       (pred_10 obj_05)
       (pred_10 obj_07)
       (pred_10 obj_15)
       (pred_10 obj_14)
       (pred_10 obj_11)
       (pred_10 obj_03)

       (pred_12  obj_12 obj_01)
       (pred_12  obj_02 obj_09)
       (pred_12  obj_17 obj_09)
       (pred_6 obj_12 obj_15)
       (pred_6 obj_02 obj_07)
       (pred_6 obj_17 obj_03)
       (pred_2 obj_03)
    )

    (:goal (and
       (pred_6 obj_17 obj_15)
    ))
(:constraints
  (always (not (pred_2 obj_11)))
)
)

; plan
1. (op_4 obj_03 obj_17)
   deleted: (pred_6 obj_17 obj_03) (pred_5)
   added: (pred_1 obj_17)
   goals met: 0 of 1
2. (op_2 obj_03 obj_07)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_07)
   goals met: 0 of 1
3. (op_2 obj_07 obj_05)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_05)
   goals met: 0 of 1
4. (op_3 obj_05 obj_21 obj_17 obj_09)
   deleted: (pred_9 obj_21)
   added: (pred_10 obj_21)
   goals met: 0 of 1
5. (op_2 obj_05 obj_21)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_21)
   goals met: 0 of 1
6. (op_3 obj_21 obj_10 obj_17 obj_09)
   deleted: (pred_9 obj_10)
   added: (pred_10 obj_10)
   goals met: 0 of 1
7. (op_2 obj_21 obj_10)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_10)
   goals met: 0 of 1
8. (op_2 obj_10 obj_08)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_08)
   goals met: 0 of 1
9. (op_2 obj_08 obj_13)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_13)
   goals met: 0 of 1
10. (op_2 obj_13 obj_15)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_15)
   goals met: 0 of 1
11. (op_5 obj_15 obj_12 obj_17)
   deleted: (pred_1 obj_17) (pred_6 obj_12 obj_15)
   added: (pred_1 obj_12) (pred_6 obj_17 obj_15)
   goals met: 1 of 1
